[
    {
        "title": "THT Online",
        "content": "KATHMANDU, JANUARY 29\nThe District Police Range, Kathmandu, has launched a joint patrol as part of security arrangements for the upcoming House of Representatives (HoR) election.\nChief of the District Police Range, Senior Superintendent of Police Ramesh Thapa, said that the joint patrol-conducted with sniffer dogs-has been deployed during both morning and night hours in accordance with the decision of the District Security Committee and the District Police Range.\nThapa stated that the mobilization of sniffer dogs has been intensified to detect explosives and drug-related activities. He added that surprise inspections are being carried out at various locations to ensure public safety.",
        "url": "https://thehimalayantimes.com/kathmandu/joint-patrol-for-election-security-in-kathmandu",
        "scraped_at": "2026-01-30T20:03:13.894292"
    },
    {
        "title": "THT Online",
        "content": "KATHMANDU, JANUARY 30\nTeam Ventures, a leading private equity and venture capital firm has made its first investment in the hospitality sector through an investment in Hotel Garima Limited, the owner of Soaltee Westend Itahari, with Team Ventures and its affiliates acquiring a 27% equity stake in the company.\nSoaltee Westend Itahari, a five-star–level hotel, is located in an emerging commercial and transit hub in eastern Nepal and operates under the Soaltee Hotels & Resorts brand, Nepal's first international hotel chain.\n\"The investment is expected to support the company's next phase of growth by advancing expansion, strengthening governance, and enhancing institutional capabilities,\" said Kesang Shrestha, Chairman of Team Ventures. The investment is supported by Team Ventures' board and leadership team, which brings deep sectoral and hospitality experience, including senior leadership and board-level involvement with international hotel chains in Nepal and the region.",
        "url": "https://thehimalayantimes.com/business/team-ventures-invests-in-soaltee-westend-itahari-marks-hospitality-fth",
        "scraped_at": "2026-01-30T20:03:15.524209"
    },
    {
        "title": "THT Online",
        "content": "KATHMANDU, JANUARY 30\nGold price in the domestic market declined on Friday after reaching a historic high a day earlier.\nThe price of gold, which surged by Rs 20,500 per tola on Thursday to a record Rs 339,300 per tola, fell by the same margin on Friday to Rs 313,800 per tola, according to the Federation of Nepal Gold and Silver Dealers' Association.\nThe latest price is the same as Wednesday's rate, which had itself marked a historic high following a Rs 9,500 per tola increase.",
        "url": "https://thehimalayantimes.com/business/gold-price-drops-after-record-high-silver-also-declines",
        "scraped_at": "2026-01-30T20:03:16.274052"
    },
    {
        "title": "Robert Yates and Dr Mahesh Kumar Maskey",
        "content": "Ensuring Universal Health Coverage (UHC) is one of the defining policy challenges of the 21st century. In election periods, few issues resonate more powerfully with voters. Everywhere, people want the same simple assurance: access to good-quality health care for themselves and their family, and protection from the financial shock of illness. Health is personal, universal, and deeply political. When political leaders understand this-and act on it-they do not just improve lives; they also significantly increase their chances of electoral success.\nThe evidence that health tops voters' priorities is unequivocal. The UN75 global survey conducted in 2020 to mark the United Nations' 75th anniversary found that access to quality health care was the single most important issue for people worldwide.\nThe most effective response to this demand has been the creation of universal health systems underpinned by socialised financing. These systems pool resources so that the healthy and wealthy subsidise care for the sick and the poor. Today, all high-income countries-except the United States-have adopted some version of this model. Whether funded through general taxation, social insurance, or a mix of both, the principle is clear: no one should be denied care or pushed into poverty because they fall ill.\nCountries with strong UHC systems enjoy longer life expectancy, lower maternal and child mortality, and better management of chronic disease. A healthier population is also more productive and remains economically active for longer. UHC therefore supports sustainable economic growth as well as social welfare.",
        "url": "https://thehimalayantimes.com/opinion/universal-health-coverage-the-decisive-election-agenda",
        "scraped_at": "2026-01-30T20:03:17.922583"
    },
    {
        "title": "Mausam Shah 'Nepali'",
        "content": "KATHMANDU, JANUARY 30\nFollowing reports of widespread defoliation in sal (Shorea robusta) forests in Dailekh district, the Forest Research and Training Centre (FRTC), under the Ministry of Forests and Environment, has conducted a field investigation to determine the causes.\nA three-member team led by Sunita Ulak, Undersecretary at FRTC, included Dr. Prem Budha, an entomologist at Tribhuvan University, and FRTC researcher Pratik Pandey. The study was carried out in coordination with the Ministry of Industry, Tourism, Forests and Environment of Karnali Province, the Karnali Province Forest Directorate, and the Forest Division Office in Dailekh.\nLocal accounts from Kimugaun Community Forest indicate that a similar outbreak occurred approximately three years ago but subsided naturally following timely winter rainfall.",
        "url": "https://thehimalayantimes.com/nepal/what-is-causing-defoliation-in-shorea-robusta-in-nepals-dailekh-district",
        "scraped_at": "2026-01-30T20:03:19.741517"
    },
    {
        "title": "Associated Press",
        "content": "MELBOURNE, JANUARY 30\nCarlos Alcaraz endured cramps and injury before fending off Alexander Zverev in an epic, momentum-swinging five-setter Friday to become the youngest man in the Open era to reach the finals of all four Grand Slam events.\nAt 22, he's aiming to be the youngest man to complete a career Grand Slam.\nHe reached his first Australian Open final the hard way, winning 6-4, 7-6 (5), 6-7 (3), 6-7 (4), 7-5 in 5 hours, 27 minutes. It was the longest match of the tournament so far, and the longest semifinal ever at the Australian Open - surpassing the 2009 classic between Rafael Nadal and Fernando Verdasco.",
        "url": "https://thehimalayantimes.com/sports/alcaraz-fends-off-zverev-and-cramps-in-an-epic-five-set-semifinal-to-reach-the-australian-open-final",
        "scraped_at": "2026-01-30T20:03:20.479814"
    },
    {
        "title": "THT Online",
        "content": "KATHMANDU, JANUARY 30\nPresident Ramchandra Paudel will pay an official visit to Japan from February 1 to 4, 2026, at the invitation of the Government of Japan, marking the 70th anniversary of the establishment of diplomatic relations between Nepal and Japan.\nDuring the visit, President Paudel is scheduled to pay a State call on Emperor Naruhito at the Imperial Palace in Tokyo on February 3. On the same day, he will also hold talks with Japanese Prime Minister Sanae Takaichi, according to to the press release issued by the Ministry of Foreign Affairs.\nEarlier, on February 2, the President will attend a special reception hosted on behalf of the Government of Japan by State Minister for Foreign Affairs Iwao Horii to commemorate seven decades of Nepal–Japan diplomatic ties. Prior to the reception, the State Minister will pay a courtesy call on the President.",
        "url": "https://thehimalayantimes.com/nepal/president-paudel-to-pay-official-visit-to-japan-from-feb-14",
        "scraped_at": "2026-01-30T20:03:22.109216"
    },
    {
        "title": "THT Online",
        "content": "KATHMANDU, JANUARY 30\nMore than 400,000 people in Sarlahi district will be administered preventive medication against elephantiasis following a rise in lymphatic filariasis infections in the area.\nThe District Health Office, Sarlahi, plans to distribute anti-elephantiasis drugs to 430,941 people, around 80 per cent of the population, across 12 local levels identified as affected.\nThe campaign was launched after tests conducted last October by the Epidemiology and Disease Control Division, Teku, in coordination with the World Health Organization, detected the spread of infection in several areas. Of 300 samples collected from Balara, Chakraghatta and Brahmapuri, 28 cases were confirmed.",
        "url": "https://thehimalayantimes.com/nepal/over-400000-in-sarlahi-to-receive-elephantiasis-prevention-drugs",
        "scraped_at": "2026-01-30T20:03:22.914241"
    },
    {
        "title": "THT Online",
        "content": "KATHMANDU, JANUARY 30\nAt least 40 people were injured when a bus overturned on the Narayangadh–Muglin road section on Friday morning.\nThe bus, bearing registration number Lumbini Province 02-100 Kha 0460 and en route from Dang to Kathmandu, met with the accident at Ghumaune in Bharatpur Metropolitan City–29.\nAccording to the District Police Office, Chitwan, three of the injured have been discharged after treatment, while others are undergoing medical care at different hospitals in the district.",
        "url": "https://thehimalayantimes.com/nepal/40-injured-in-bus-accident-on-narayangadhmuglin-road",
        "scraped_at": "2026-01-30T20:03:23.656432"
    },
    {
        "title": "THT Online",
        "content": "KATHMANDU, JANUARY 30\nThe Consulate General of Nepal in New York has issued an urgent notice warning Nepali citizens residing in the United States against illegally accessing public benefits and misusing visa conditions, stating that such actions could lead to visa or Green Card cancellation.\nAccording to the notice, U.S. authorities have informed that foreign nationals who provide false or misleading information to obtain benefits meant for U.S. citizens, such as subsidized healthcare, housing, family assistance, or educational support, may face direct legal consequences affecting their immigration status.\nThe consulate noted that data from Nepali citizens who traveled to the U.S. in 2024 show Nepalis among the top groups availing subsidized services, prompting the U.S. government to issue a public notice temporarily suspending immigrant visas for Nepali nationals.",
        "url": "https://thehimalayantimes.com/nepal/nepal-consulate-warns-nepalis-in-us-against-misuse-of-public-benefits-visa-violations",
        "scraped_at": "2026-01-30T20:03:25.261651"
    }
]