[
    {
        "title": "Pokhara’s garbage: Roads partly cleared, waste piles up in homes",
        "content": "POKHARA, Jan 30: Waste management in the tourist city of Pokhara has yet to return to full operation. Even after more than two weeks, piles of garbage remain visible at various intersections across the city. While the metropolitan city has managed to clear some waste dumped along roadsides, household garbage collection has not resumed, leaving trash piled up inside many homes.\nAccording to the metropolitan city authorities, the problem has escalated due to growing disputes over a new waste management site. Previously, waste was managed at Lameahal in Pokhara Metropolitan City–32, but the site has now reached full capacity, forcing the city to search for an alternative location. As garbage continues to pile up in homes and along roadsides, the entire tourist city has begun to reek of foul odour.\nThe metropolitan city says it has been unable to collect waste because the Lameahal site is full and a new location has not yet been finalised. Although discussions are underway to identify a new site, no concrete decision has been made so far. While Majuwa in Pokhara–32 has been identified as a possible temporary solution, the matter remains unresolved.\nOn one hand, garbage has accumulated on roads due to the lack of a landfill site; on the other, plans to build a modern waste processing centre at the Jhankri khola landfill site in Pokhara–33 have triggered protests from locals. Information officer of the metropolis Krishna Prasad Tiwari said discussions are ongoing to temporarily manage waste in Majuwa after failing to secure a new site. Since Majuwa is located close to Lameahal, the city is considering setting up temporary structures there for waste management. However, even waste disposal at Lameahal has faced intermittent obstructions.",
        "url": "https://myrepublica.nagariknetwork.com/news/pokharas-garbage-roads-partly-cleared-waste-piles-up-in-homes-95-81.html",
        "scraped_at": "2026-01-30T19:52:59.302136"
    },
    {
        "title": "Around 380,000 taxpayers added in six months, VAT registrations up by 13,257",
        "content": "KATHMANDU, Jan 30: Nearly 380,000 new taxpayers were added in the first six months of the current Fiscal Year (FY), according to data released by the Ministry of Finance on Thursday.\nFrom mid-July (Shrawan) to mid-January (Poush), a total of 379,212 taxpayers were registered nationwide. Of them, 55,242 were registered under business PAN, 304,890 under individual PAN, 871 under W-PAN, 13,257 under VAT, and 4,952 under excise duty.\nWith the latest additions, the total number of PAN-registered taxpayers has reached 7,360,353, while 364,992 taxpayers are registered under VAT and 129,949 under excise duty.",
        "url": "https://myrepublica.nagariknetwork.com/news/around-380000-taxpayers-added-in-six-months-vat-registrations-up-by-13257-23-99.html",
        "scraped_at": "2026-01-30T19:52:59.768122"
    },
    {
        "title": "NexGen Management secures CARE NP BB rating, plans Rs 125 million IPO",
        "content": "KATHMANDU, Jan 30: NexGen Management and Equity Solutions Limited has received a CARE NP BB Double B rating ahead of its planned initial public offering (IPO).\nCARE Ratings Nepal assigned the rating, indicating a moderate level of risk in the company’s ability to meet its financial obligations.\nEstablished in 2074 BS, the company has been operating profitably for the past six years. NexGen Management, which functions as an investment company, has already raised Rs 500 million from its promoters.\nA special general meeting held on Magh 5 approved the issuance of 20 percent shares to the general public, which will increase the company’s paid-up capital to Rs 625 million.",
        "url": "https://myrepublica.nagariknetwork.com/news/nexgen-management-secures-care-np-bb-rating-plans-rs-125-million-ipo-35-55.html",
        "scraped_at": "2026-01-30T19:53:00.228572"
    },
    {
        "title": "Panama court annuls Hong Kong firm's canal port concession",
        "content": "PANAMA CITY, Jan 30: Panama's Supreme Court annulled on Thursday the concession allowing Hong Kong-based CK Hutchison to operate ports at the Panama Canal, a ruling that undermines Chinese sway over the waterway.\nAs Beijing and Washington vie for global influence, container ports have become a prized currency -- especially those situated in geopolitically strategic locations such as the Panama Canal.\nJust days into US President Donald Trump's second term, he threatened to take back the canal -- built by the United States and handed to Panama in 1999 -- claiming Beijing was effectively \"operating\" it.\nPanama has rejected the claim that China had de facto control over the canal, which handles 40 percent of US container traffic, while taking actions to appease Trump.",
        "url": "https://myrepublica.nagariknetwork.com/news/panama-court-annuls-hong-kong-firms-canal-port-concession-68-48.html",
        "scraped_at": "2026-01-30T19:53:00.693937"
    },
    {
        "title": "10 foreign companies eye operation of Nagdhunga Tunnel Road",
        "content": "KATHMANDU, Jan 30: Even as construction of the much-awaited Nagdhunga Tunnel Road nears completion, its commercial operation remains stalled, with uncertainty over the selection of a service provider. Ten foreign companies have now expressed interest in operating and managing the tunnel, highlighting both the project’s strategic importance and the complexities delaying its launch.\nAccording to Sanjay Panthi, undersecretary of the Nagdhunga Tunnel Road Project, applications were submitted by six Chinese companies, three Indian companies, and one Turkish company within the stipulated deadline. “The evaluation process to select one company is currently underway,” Panthi said, adding that a decision is likely within a month.\nUnder existing provisions, the selected foreign company will be required to partner with a Nepali firm—a mandatory condition intended to ensure local participation in the tunnel's operation and management.\nThe process, however, has not been straightforward. The Department of Roads (DoR) had to extend tender deadlines several times in its attempt to appoint a service provider. While the final deadline was set for mid-January, earlier deadlines had been fixed for December 17 and later extended to December 31, reflecting the challenges faced in finalizing an operator.",
        "url": "https://myrepublica.nagariknetwork.com/news/10-foreign-companies-eye-operation-of-nagdhunga-tunnel-road-44-58.html",
        "scraped_at": "2026-01-30T19:53:01.142841"
    },
    {
        "title": "Britain's Starmer seeks to bolster China ties despite Trump warning",
        "content": "SHANGHAI, Jan 30: Visiting Prime Minister Keir Starmer said on Friday that Britain has a \"huge amount to offer\" China, after his bid to forge closer ties prompted warnings from US President Donald Trump.\nThe first visit to China by a British prime minister in eight years, Starmer's trip follows in the footsteps of other Western leaders looking to counter an increasingly volatile United States.\nLeaders from France, Canada and Finland have flocked to Beijing in recent weeks, recoiling from Trump's bid to seize Greenland and tariff threats against NATO allies.\nTrump warned on Thursday it was \"very dangerous\" for Britain to be dealing with China.",
        "url": "https://myrepublica.nagariknetwork.com/news/britains-starmer-seeks-to-bolster-china-ties-despite-trump-warning-53-36.html",
        "scraped_at": "2026-01-30T19:53:01.606467"
    },
    {
        "title": "Home Minister says Gen Z movement redefines democracy, strengthens good governance",
        "content": "KATHMANDU, Jan 30: Home Minister Om Prakash Aryal has said that the Gen Z movement of September 8 delivered a clear message about redefining democracy and strengthening good governance.\nSpeaking on Friday at the inauguration of the “National Martyrs’ Day 2082 and Gen Z Good Governance Warriors and Immortal Police Martyrs Memorial Pillar” at the National Martyrs and Peace Park (Nijamati Park) in Gokarneshwar, Kathmandu, Minister Aryal highlighted the movement’s role in strengthening democratic governance. He said that while past struggles were aimed at establishing democracy, the recent movement has further consolidated the achievements made so far.\n“The recent Gen Z movement has enriched the understanding and practice of democracy while advancing good governance,” he said. He added that the government is prioritising the efficient delivery of services.\nReferring to the events of September 8 and 9, Aryal said, “Humanity was particularly mocked during those incidents. The events of the following day threatened the very foundation of the nation, but we prevented a national crisis, restoring peace and normalcy.”",
        "url": "https://myrepublica.nagariknetwork.com/news/home-minister-says-gen-z-movement-redefines-democracy-strengthens-good-gove-26-95.html",
        "scraped_at": "2026-01-30T19:53:02.063692"
    },
    {
        "title": "Husband surrenders to police after killing wife in Lalitpur",
        "content": "KATHMANDU, Jan 30: A man has surrendered to police after allegedly killing his wife in Lalitpur.\nAccording to police, 30-year-old Binod Pakhrin of Godawari Municipality–7, Devichaur presented himself at the Tikabhairav Police Post following the incident. Police said he admitted to killing his 23-year-old wife, Kopila Pakhrin.\nPreliminary investigation indicates that the couple had consumed alcohol and got into an argument, during which the man allegedly assaulted his wife with a wooden plank, leading to her death. Her body was later found placed on a bed inside the house.\nThe incident occurred on Friday morning. After the killing, the accused went directly to the police office and confessed. Police have taken him into custody and further investigation is underway.",
        "url": "https://myrepublica.nagariknetwork.com/news/husband-surrenders-to-police-after-killing-wife-in-lalitpur-44-53.html",
        "scraped_at": "2026-01-30T19:53:02.517535"
    },
    {
        "title": "Home Ministry rolls out special plan to ensure free, fair and fear-free elections",
        "content": "KATHMANDU, Jan 29: The Ministry of Home Affairs has unveiled a special concept aimed at conducting elections in a free, fair and fear-free environment by strengthening coordination and cooperation down to the ward level.\nThe ministry has developed the concept titled “Enhancing Coordination and Cooperation up to the Ward Level for Systematic Election Management, 2082” and has directed district administration offices to implement it accordingly.\nThe plan seeks to increase the participation of political party representatives active at the ward level, civil society members, media professionals, private sector representatives and intellectuals across all stages of the electoral process, acknowledging their key role in credible election management.\nMoHA Spokesperson Anand Kafle said the concept was introduced to enhance ownership of the electoral process by involving ward-level political figures, office-bearers and intellectuals in election management, thereby ensuring a free, fair and fear-free election.",
        "url": "https://myrepublica.nagariknetwork.com/news/home-ministry-rolls-out-special-plan-to-ensure-free-fair-and-fear-free-elec-23-55.html",
        "scraped_at": "2026-01-30T19:53:02.988272"
    },
    {
        "title": "Heavy snowfall cuts off Upper Mustang",
        "content": "POKHARA, Jan 30: Heavy snowfall has completely severed road connectivity between the district headquarters and the Upper Mustang region, including Lo Manthang. Local authorities said travel beyond Kagbeni is currently impossible due to thick snow accumulation, while access to the Muktinath area has also become difficult.\nAccording to Umesh Paudel, chief of the Annapurna Conservation Area Project (ACAP) in Lo Manthang, heavy snow has accumulated across the region, with nearly two feet of snow piled up on rooftops. Although the sun has appeared, movement remains challenging as the snow has not yet melted. Snow up to one-and-a-half feet deep has also covered roads.\nPaudel said activity in Lo Manthang is minimal, as most residents from the upper region have moved to lower areas, including Pokhara, to escape the harsh winter. At present, only around 50 people remain in Lo Manthang. With most villagers already away and snowfall adding to the isolation, the area has become even quieter. As this is not the tourist season, neither domestic nor foreign tourists are currently visiting the region. Only a few residents staying behind to look after their homes remain in the villages.\nWhile residents are clearing snow from rooftops and pathways for limited movement, vehicles cannot operate, Paudel said. He added that people who move down for the winter usually return to their villages only after Falgun (mid-February). Due to snowfall and the absence of voters, election-related activities have also been halted in the upper region.",
        "url": "https://myrepublica.nagariknetwork.com/news/heavy-snowfall-cuts-off-upper-mustang-25-11.html",
        "scraped_at": "2026-01-30T19:53:03.450570"
    }
]