[
    {
        "title": "First edition of Congress Dabali concludes",
        "content": "Kathmandu, January 30\nThe inaugural edition ofCongress Dabali, a new forum examining the future of theNepali Congress(NC) from the perspective of non-Congress individuals, concluded on Friday, featuring journalist and author Basanta Basnet. The program was moderated by Bikal Rai.\nSpeaking at the event, Devraj Chalise, spokesperson for the Nepali Congress, highlighted the political shifts in Nepal following the Gen Z movement of September 23–24.\n“The political landscape has changed drastically,” Chalise said. “For the Nepali Congress, these changes have been even more significant, with the election of new leadership through the special convention. In such a critical moment, it is important to hear from non-Congress individuals on how the party can improve in the days ahead.”\nBasnet, reflecting on the party’s evolution, emphasised that the age of a political party is less important than its culture, values, and commitment.\n“The Nepali Congress has shown that revolution can happen from within,” he said, praising the thousands of party cadres who contributed to the special convention. However, Basnet added that holding a convention alone is not enough.\n“It is equally essential to review past mistakes and move forward with progressive thought and action,” he said.",
        "url": "https://english.onlinekhabar.com/first-edition-congress-dabali.html",
        "scraped_at": "2026-01-30T19:44:45.892714"
    },
    {
        "title": "Decrease in gold, silver prices",
        "content": "Kathmandu, January 30\nBreaking the continuously increasing trend, the gold and silver prices have declined in the domestic market today, the last trading day of the week. According to the Federation of Gold and Silver Dealers’ Association, the price of gold has been set at Rs 318,800 per tola (11.66 grammes) today against Rs 339,300 per tola on Thursday.\nSimilarly, silver is being traded at Rs 7,065 per tola today. It was Rs 7,505 on Thursday. The gold price was determined at Rs 318,800 per tola on Wednesday, while the price of silver per tola was Rs 7,300 per tola.\nLikewise, gold was traded at Rs 309,300 per tola and silver at Rs 6,870 per tola on Tuesday. According to international media, gold is being traded at 5,537 US dollars per ounce and silver at 117 US dollars per ounce in the international market today.\n",
        "url": "https://english.onlinekhabar.com/decrease-in-gold-silver-prices.html",
        "scraped_at": "2026-01-30T19:44:48.927337"
    },
    {
        "title": "PM Karki pays tribute to martyrs",
        "content": "RSS\nKathmandu, January 30\nPrime Minister Sushila Karki visited the Martyrs Memorial at local Lainchaur and offered tribute to the known and unknown martyrs today, on Martyrs Day. On the occasion, the Prime Minister paid homage to honour the brave individuals who sacrificed their lives in various movements throughout history for democracy, the nation, and freedom on behalf of the people.\nOn the last day of the week-long programme commemorating the Martyrs, a special tribute ceremony was held today at the Shaheed Uddyan, Lainchaur. The Kathmandu Metropolitan City has been marking a week-long programme starting from the 10th of Magh month every year. A morning procession was organised from Shanti Batika on the Martyrs’ Day today.\nThe morning procession comprised the Nepal Police and Armed Police Force bands, a march past, and a carriage mounted with portraits of the martyrs. The procession reached the Martyrs Park in Lainchaur and transformed into a commemoration ceremony.\nThe meeting was attended by Prime Minister Karki, Home Minister Om Prakash Aryal, ministers, senior government officials, people’s representatives and chiefs of security agencies. Addressing the function, Acting Mayor of Kathmandu Metropolitan City, Sunita Dangol, expressed the view that efforts and sacrifices made in the past for civil liberty, human rights, good governance, and dignity should not be forgotten.\nThe government has declared today a public holiday on the occasion of Martyrs’ Day.\n",
        "url": "https://english.onlinekhabar.com/pm-karki-pays-tribute-to-martyrs.html",
        "scraped_at": "2026-01-30T19:44:51.560123"
    },
    {
        "title": "Nipah virus at Nepal’s doorstep: Why vigilance matters now",
        "content": "Nepal has not reported any confirmed cases ofNipah virusso far. However, recent infections in India’s West Bengal, including among doctors and nurses, show that the risk is close. Nepal has already started screening travellers at airports and land border points, but the real question is whether the country is fully prepared if a case does appear.\nNipah virus is rare but extremely deadly. Between 40 and 75 per cent of people who become infected do not survive, and there is no approved vaccine or specific treatment. For a country like Nepal, closely connected to India and facing rapid environmental and population changes, this is a public health threat that should not be ignored.\nThe World Health Organization lists Nipah virus among its top priority diseases because of its potential to trigger outbreaks with devastating consequences. Unlike many viruses that capture headlines, Nipah does not need large numbers to cause large damage. Even small outbreaks have overwhelmed health systems and left lasting social and economic scars.\nNepal shares an open and porous border with India, with millions crossing annually for work, healthcare, trade, and family ties. West Bengal, where recent Nipah cases have emerged, is directly connected to Nepal through multiple land routes. Human mobility is essential for livelihoods, but it also enables pathogens to move silently across borders.\nAirport and border screening are important first steps. However, Nipah’s incubation period can range from 4 to 21 days, and in some cases even longer. This means infected individuals may show no symptoms at the time of travel, making detection at entry points inherently limited.\nNipah virus is zoonotic, meaning it spreads from animals to humans. Its natural reservoirs are fruit bats, particularly those of thePteropusgenus, commonly known as flying foxes. These bats are widely distributed across South and Southeast Asia, including many parts of Nepal.\nTransmission can occur through direct contact with infected animals, consumption of food contaminated by bat saliva or urine, or close contact with infected people and their bodily fluids. In Bangladesh, repeated outbreaks have been linked to the consumption of raw or fermented date palm sap contaminated by bats. While this specific practice is uncommon in Nepal, the broader risk, food and drink exposed to wildlife, is very real.\nCrucially, the strain of Nipah circulating in India and Bangladesh can spread from person to person, particularly in households and healthcare settings. This has been documented repeatedly, often affecting caregivers and health workers. In recent Indian outbreaks, doctors and nurses were among those infected, an alarming reminder of how quickly health facilities can become amplification points.\nNepal’s vulnerability to zoonotic diseases like Nipah is shaped not only by geography, but also by rapid environmental and social change. Over recent decades, forest cover has expanded in many regions due to conservation success. At the same time, human settlements have pushed closer to forest edges.\nIn districts such as Chitwan, Pokhara, Gulmi, and Mustang, community members report seeing more wild animals near homes and farms—monkeys, deer, wild boar, porcupines, and bats. Bats are frequently observed roosting near cattle sheds, sometimes biting calves. These everyday interactions, often considered normal, are precisely where spillover events can occur.\nCultural practices also matter. In some communities, wild animals are still hunted or consumed despite legal restrictions. Bats have been used in traditional medicine, while wildlife meat consumption, though declining, has not disappeared entirely. These practices do not imply blame; rather, they highlight the need for culturally sensitive public health communication that respects tradition while reducing risk.\nAs one health practitioner noted, Nepal’s increasing population, habitat encroachment, and open border with India together create “very favourable conditions” for the emergence or re-emergence of zoonotic diseases. Nipah is a textbook example of such a threat.\nNipah infection often begins with non-specific symptoms: fever, headache, muscle pain, vomiting, or sore throat. This makes early detection difficult, especially in Nepal, where febrile illnesses are common, and healthcare access varies widely.\nIn severe cases, the virus attacks the brain, causing encephalitis. Patients may develop confusion, drowsiness, seizures, and coma within days. Pneumonia and severe respiratory distress can also occur. Even among survivors, long-term neurological complications, such as persistent seizures or personality changes, have been reported. In rare cases, the virus can reactivate months or years later.\nTreatment is limited to intensive supportive care. There is no proven antiviral therapy and no licensed vaccine. This reality makes prevention, early detection, and infection control far more important than clinical treatment alone.\nWhat Nepal should do now\nNepal still has a critical window to prepare before a crisis emerges. Several steps are essential:\nFor the general public, simple measures matter: avoiding consumption of fruits that may be contaminated by bats, minimising contact with wild animals, practising hand hygiene, and seeking prompt medical care for severe illness—especially after travel to affected regions.\nNipah virusis not new. It has been known for more than two decades, and its patterns are well documented. What remains uncertain is whether countries act decisively before outbreaks occur or only after lives are lost.\nNepal has no Nipah cases today. That is precisely why this moment matters. Vigilance now quiet, informed, and sustained offers the best chance to ensure that Nipah remains a warning from across the border, not a headline at home.\n\n\n",
        "url": "https://english.onlinekhabar.com/nipah-virus-at-nepals-doorstep-why-vigilance-matters-now.html",
        "scraped_at": "2026-01-30T19:44:55.077596"
    },
    {
        "title": "Heightened security measures introduced in Kathmandu before election",
        "content": "Kathmandu, January 30\nAhead of theHouse of Representatives Electionsscheduled for March 5, Kathmandu District Police have stepped up patrols across the capital.\nSenior Superintendent of Police Ramesh Thapa, chief ofKathmandu District Police Range, said integrated security patrols have been launched as part of election-focused security measures.\nAccording to him, joint patrols involving the Nepali Army, Nepal Police, and the Armed Police Force are currently underway in Kathmandu.\nPolice have also begun inspections of hotels and lodges, including dog-sniffing operations, and have launched surprise checks at various locations across the city.\nSSP Thapa said security teams are collecting information on potential threats, analysing them, and formulating security strategies accordingly.\nKathmandu district has a total of 320 polling stations, of which 176 are classified as normal and 144 as sensitive. There are no polling stations categorised as highly sensitive in the district.\nFor the election, 3,854 temporary election police personnel have been deployed in Kathmandu alone.",
        "url": "https://english.onlinekhabar.com/tight-security-kathmandu-election.html",
        "scraped_at": "2026-01-30T19:44:59.583163"
    },
    {
        "title": "Nepal’s election campaign gains pace but manifestos remain absent",
        "content": "As the House of Representatives election scheduled for March 5 draws closer, candidates have already begun campaigning. They are meeting voters and conducting door-to-door outreach in their constituencies to seek public support. On digital platforms, too, candidates have been strengthening their presence with the same aim.\nOne critical element, however, is missing: none of the political parties has released a manifesto. A manifesto is among the most important tools in an election, offering voters a clear basis on which to judge candidates and parties. Yet parties appear to be avoiding this essential responsibility.\nAs of this writing, just 36 days remain until the election, but no party has published its manifesto. Candidates are therefore campaigning without clearly articulating their policy priorities or governing vision.\nThe election date was announced six months ago, following the formation of an interim government under Prime Minister Sushila Karki after the Gen Z–led protests of September 8 and 9. Political parties had ample time to prepare and present their manifestos. Their failure to do so has prompted growing public concern.\nPolitical analyst Saugat Gautam says that because all major parties have already selected their prime ministerial candidates, many contenders are focused more on promoting those figures than on communicating their own plans and agendas. As a result, he says, the campaign has become increasingly centred on individuals rather than policies.\n“The sooner the manifesto is published, the better,” Gautam says toOnlinekhabar. “If there is a delay, people will have less time to critically assess it.”\nConcerns over the delay have also been voiced on social media. Rakshya Bam, a Gen Z activist, has publicly urged parties to release their manifestos as soon as possible.\n“We want to read your manifesto,” shewrites. “The public will vote based on the plans and agendas you intend to implement after becoming parliamentarians. Be accountable to the people and publish your manifesto.”\nOnline criticism has continued to grow, though political parties appear largely unresponsive. Writer Srijana Pokhrelnotedin a recent social media post that more than a dozen candidates contesting the election are her Facebook friends, representing different parties. She said she reviewed each of their profiles but did not find a single candidate who had pinned their party’s manifesto.\nPokhrel also criticised candidates who ask voters to judge them by their records, arguing that such records are often “disgraceful.” At the same time, she questioned candidates with no political track record, asking whether they expect voters to support them based solely on an introductory video. “This is an election, not a beauty pageant,” she wrote.\nThe Nepali Congress, for its part, says it is still in the preliminary phase of drafting its manifesto.\n“We are still at an initial stage and are consulting experts from different sectors,” says Pratap Paudel, political adviser to Gagan Thapa, the party’s president.\nPaudel says the manifesto had not been delayed, adding that election-related activities already underway may have created the perception that its release was overdue. “In fact, manifestos are usually announced only about a month before the election,” he said. He added that Thapa is currently campaigning in Sarlahi and that a party meeting will decide the date of publication after his return.\nThapa is leading the manifesto drafting process for the Nepali Congress.\nUnlike the Nepali Congress, the CPN-UML says it is in the final stage of preparing its manifesto.\n“We are almost ready to publish it,” says Min Bahadur Shahi, head of the party’s publicity department.\nShahi said a few issues still required internal discussion before the manifesto could be released.\n“We are trying to publish it as soon as possible,” he added.\nThe Rastriya Swatantra Party has informed that it plans to release its manifesto on February 13.\n“We are reviewing the draft and compiling suggestions and findings from provincial consultations and field studies,” says Manish Jha, the party’s spokesman.\nThe manifesto is being drafted under the leadership of Swarnim Wagle, the party’s vice chairman. Jha said that because candidate nominations were filed 45 days ahead of the election, compared with 17 days in previous cycles, many people felt the manifesto announcement was overdue.\nKrantishikha Dhital, a central committee member of RSP actively involved in drafting the manifesto, said the party would release practical and achievable pledges rather than grand, unrealistic promises.\n“We are not preparing impossible or irresponsible declarations. The manifesto is being drafted in a way that directly addresses the concerns of young people,” says Dhital. “We will come forward soon with proposals that reflect the public’s expectations. Our focus will be on education, health care, employment and capital formation.”\nWith just over five weeks remaining before voters go to the polls, the absence of manifestos has left many unsure how to compare candidates beyond personalities and past affiliations, raising broader questions about accountability and policy-driven debate in the campaign’s final stretch.\nParty leaders also acknowledge that delays in releasing the manifesto could make it more difficult for voters to compare candidates.",
        "url": "https://english.onlinekhabar.com/nepals-election-manifestos-absent.html",
        "scraped_at": "2026-01-30T19:45:02.906321"
    },
    {
        "title": "Meet Sharda Kumari Paudel, first female principal of Nepal’s oldest school",
        "content": "Following an intensely complex political period, Nepal this year appointed its first woman prime minister, a historic milestone. While the appointment of Sushila Karki as the country’s first female prime minister has drawn global attention, another appointment within Nepal has received far less discussion despite its significance.Durbar High School, also known as Bhanu Secondary School, the first school in Nepal, has appointed its first female principal, 172 years after its establishment.\nOn November 20, Sharda Kumari Paudel was appointed principal of Durbar High School. Previously, she had been serving as the school’s acting principal.\nBeing promoted from acting principal to principal, Paudel says she now feels more confident, responsible, and challenged.\nShe was appointed through an open competition among three contenders, in which she was the only female candidate.\nEstablished in 1854, Durbar High School took a long time to appoint a female principal. In this context, Paudel notes that in the past, women rarely entered the teaching profession, and those who did were mostly limited to teaching at the primary level.\n“Women in the past were confined to family life due to societal structures, which limited the time they could devote to their professional development,” says Paudel. “As a result, it took a long time for women in almost every sector to reach higher positions, and Durbar High School is no exception.”\nHowever, Paudel considers herself fortunate, as it was her father who inspired her to become a teacher and pursue a career in the profession.\n“My father always motivated me to serve society, and as a result, I chose to become a teacher,” she says.\nBorn in Syangja in western Nepal, Paudel joined the teaching profession in 2004. Her first posting was at Mahendra Rastriya Secondary School in Baluwatar, where she taught health education for 10 years. In 2014, she joined Durbar High School as a permanent secondary-level teacher, teaching economics.\nIn 2019, she was appointed assistant principal of the school. At that time, Durbar High School had only 71 students. In 2020, at the height of the COVID-19 pandemic, she was appointed principal with limited responsibilities. Under her leadership, the school began conducting virtual classes. Despite the challenges, the school also focused on strengthening extracurricular activities. It organised a national essay competition on the impact of COVID-19 and established a robotics lab.\nDurbar High School became the first government school in Nepal to introduce robotics classes. Students from the robotics program went on to win several competitions and participate in international events outside Nepal. Meanwhile, the school, severely damaged by the devastating 2015 earthquake, completed its renovation. In collaboration with Kathmandu Metropolitan City, smart boards were also installed in classrooms. After physical classes resumed, the number of students increased to 350.\nAs the quality of education improved, Durbar High School began attracting public attention. Even parents who had been sending their children to private schools started enrolling them at Durbar High School, one of the rarest shifts seen in Nepal’s education sector.\nSimilarly, under Paudel’s leadership, the school’s canteen and security systems improved. Currently, the school has 1,095 students. Managing such a large number of students has become one of Paudel’s major challenges as principal.\nThe challenge is compounded by the fact that Sanskrit Secondary School, which has around 900 students, is also operating within the Durbar High School building.\n“As two different institutions run in the same building, conflicts sometimes arise among students and teachers, and in such cases I have to be especially sensitive,” says Paudel.\nDue to overcrowding, the school is compelled to run tiffin breaks multiple times, which often causes disturbances. Efforts are underway to address this challenge, she adds.\nWhile the number of students continues to grow each year, the school’s resources remain limited. However, with support from guardians, the school has managed to recruit additional staff.\nTo prevent a shortage of teachers, the school has recently introduced the concept of a “Teachers Bank.” The Teachers Bank serves as a backup pool of teachers. For instance, if a teacher is unable to attend classes for a week or longer, the school can reach out to teachers listed in the Teachers Bank. The school has also publicly advertised this initiative and invited interested individuals to join. As a result, Paudel has received many inquiries and has been personally handling the process.\nPaudel’s tenure as principal will be four years. Speaking toOnlinekhabar, she shared the plans she hopes to accomplish during her term.\nHer priority is to strengthen the school’s technological capacity so that students become more technologically skilled. Second, she plans to introduce more optional subjects. She also aims to prioritise sports. Lastly, she intends to improve students’ public speaking skills and further enhance the quality of the robotics program.\n“My goal is to make Durbar High School a place where students are confident, skilled, and ready to compete anywhere, not just in exams, but in life,” says Paudel.",
        "url": "https://english.onlinekhabar.com/principal-sharada-kumari-paudel.html",
        "scraped_at": "2026-01-30T19:45:06.567066"
    },
    {
        "title": "Fearless and unbound Nepali youth make historic wheelchair bungee jump",
        "content": "Dilip Sapkota of Chautara Sangachokgadhi Municipality–5, Sindhupalchok and Shishir Dahal of Kamalamai–5, Sindhuli, completed a wheelchair bungee jump from the suspension bridge over the Bhotekoshi River in Sindhupalchok.\nThey claim this bungee jump, said to be the first of its kind in Nepal, is historic. Sapkota asserts that he is the first person in Nepal’s history to do a bungee jump in a wheelchair.\nAmong the two, Sapkota jumped first from the 160-meter-high suspension bridge, and Dahal successfully followed soon after.\n“It was a historic leap, for the first time in Nepal, I did a bungee jump from a wheelchair,” Sapkota says with excitement. “These activities are not just displays of personal courage. I want accessible tourism to grow in Nepal, and I want people with disabilities to participate equally in hiking, trekking, and adventure activities. That’s why I keep taking part in new and challenging adventures, hoping my experience will inspire confidence, motivation, and courage in others with disabilities.”\nDahal shares a similar experience. He toldOnlinekhabarthat the bungee jump was an enjoyable and memorable experience.\n“I wanted to experience it for myself. But I also wanted my attempt to inspire others, which is why I jumped along with my wheelchair,” Dahal says. “The bridge shook slightly, but the moment above the river,  being the first to bungee in a wheelchair was unforgettable.”\nShishir added, “I had done such adventure activities before, but this time I wanted to inspire others with disabilities and hopefully shift society’s perception of people with disabilities, which is why I did the bungee in a wheelchair.”\nAfter suffering a spinal injury that left him bedridden and unable to move for a long time, Sapkota now travels on a disability-friendly scooter and wheelchair, becoming a strong voice for thousands of people with disabilities.\nSapkota has been participating in paragliding, zipline, swing, and other adventure activities for a long time.\nHe is not only an adventure enthusiast but also a committed advocate for inclusive tourism. Despite his disability, he serves as the secretary of the Jugal Tourism Promotion and Environment Conservation Forum Nepal, continuously lobbying for accessible tourism. He believes that making trails, routes, and services in Nepal’s tourism sector accessible for people with disabilities must now be a mandatory agenda.\nDahal, who joined Sapkota in the bungee jump, has been living with spinal paralysis due to a motorcycle accident.\nHe has been using a wheelchair for four years. Dahal runs an agricultural nursery in Bhaktapur. Alongside the nursery, he also works as a graphic designer and social media manager, and holds leadership roles in various sports and entertainment-related organizations.",
        "url": "https://english.onlinekhabar.com/wheelchair-bungee-jump.html",
        "scraped_at": "2026-01-30T19:45:13.267002"
    },
    {
        "title": "Know what are yomaris and learn how to cook them on your own",
        "content": "Considered one of the signature dishes of theNewa community, yomari is arguably a local invention that is both sweet and healthy. On the full moon day of Thinlaa: (the second month of Nepal Sambat) or Marga Shukla Paksha, the Newa community celebrates Yomari Punhi, where primarily the households make yomari of various shapes and sizes. The day is also celebrated asJyapuDiwas or Dhanya Purnima. Meanwhile, the Kirant community celebrates it as Udhauli.\nIt is said yomari was first made by a Newa couple working in the field of Panauti. Since rice was the prime harvest, the couple decided to use the harvest and make yomari out of it. Also, since it was winter, they filled it withchaku(molasses) to increase body heat. As a part of the community, the couple also shared their harvest and yomari with the neighbours.\nThe signature shape of the yomari is also said to resemble the fig.\nAnother story is of Chhinnapatta Maiju and yomari, but this yomari is about the fig. According to a cultural expert and retired Nepal Bhasa professor at Tribhuvan University, Chunda Bajracharya, “In this folklore, we hear the story about two sisters. The elder is Chhinnapatta Maiju, who was disliked by her mother. She had a goat as her friend. Her mother killed her beloved goat and Chhinnapatta took the bones out and buried them in the ground. It is said a fig tree grew out of there and she used to spend more time there.”\nShe continues, “One day when she was up in the tree, lakhe and lasi: (a demon couple) came there and tricked her into bringing the fig down to them. Chinnapatta got kidnapped and then was taken to their abode. The demon couple directed her to make roti (flatbread) for them. While in the kitchen, a mouse came to Chinnapatta and asked for roti. The mouse, in return for the roti, warned her that the demon couple were planning to eat her, so she better run with all the jewels they had stored. Chinnapatta Maiju adhered to it and went home with the jewels.”\n“Seeing her coming back with the jewels, the mother questioned her on what happened. After Chinnapatta briefed them, the mother directed her younger daughter to get kidnapped and get more jewels from the couple. She did, but she ignored the mouse unlike her sister and failed to get the warning. The demon couple then slept with the girl in between and ate her.”\nAs an act of gratitude for the good harvest, it is a custom for the people to offer yomari to the gods and goddesses. It can be in any shape or size; more common are the signature shape of the yomari while others also make them in the shape of gods and goddesses.\nAs the day is celebrated in winter, people also follow the tradition of sitting in front of makal (traditional firepots) to keep themselves warm. “Many also eat roasted eggs, garlic, and potatoes while sitting around the fire. However, the tradition is rarely seen nowadays,” Bajracharya laments.\nChildren also go around to ask for yomari where the households share their fortune by giving it back to the community. Charity on the day is also very common, she adds.\nOther tradition includes guru puja (worshipping teachers) where people worship books and their teachers.\nChef Santosh Sah made yomari famous in the international cooking show Masterchef UK 2020. Looking at that, many are inclining towards tasting this local delicacy. With its newfound fame and the local festival in mind, here is how you can make yomari and enjoy this tasty delicacy at your own home:\nYou need a bowl of rice flour. You also need boiled water to make the dough.\nBoil water in a pot. Then, put the hot water in the rice flour, and mix them together. Knead the mixture and make it into a dough. [You have to be careful as the mixture can be hot to touch].\nWhen the dough is ready, wrap the dough in a cotton cloth. Leave it aside for half an hour or overnight.\nIn a pan or a pot, put water and chaku. With heat, the chaku turns into liquid. The mixture should be consistent and thick but runny. Mix black sesame seeds and powder into the pan, and mix all. Add cinnamon or cardamom for taste. Put it aside to cool down.\nMix a bit of water and make it a paste. In the paste, mix coconut, sugar, and almonds. Add cinnamon or cardamom for taste. And put it aside to cool down.\nPut oil on the palm. Take a dollop of the dough into your hands and give it the shape. Start on one side, roll the dough between your palms for an elongated tail or lower half of the yomari. On the top, poke a hole. With your index finger slowly start pressing and rolling the dough in your palms. Make the base like a vessel to put your fillings.\nPut a spoon of your fillings and cover the opening by slowly pressing the opening with your hands. Give shape to the top any way you like it.\nContinue the process to make as many yomari as you want.\nThe way you make yomari is just like making momos. So, you can use the same pot you would use to make momos.\nPut the water to boil.\nOil the pot base before putting in the yomari. Make sure there are gaps for the yomari so that they do not stick.\nWhen the water boils, keep the base on top of that to make yomari.\nCook it for 10 to 12 minutes.\nTake the hot yomari into a plate and serve it.\nGarnish it with chopped almonds or chocolate syrup or any ingredient you would like before serving.\nFrom thearchive.",
        "url": "https://english.onlinekhabar.com/yomari-punhi-newa-festival-nepal.html",
        "scraped_at": "2026-01-30T19:45:17.125209"
    },
    {
        "title": "With foreign talent and rising crowds, Nepal’s cricket finds fresh energy",
        "content": "Right now in Nepal, as the clock strikes either 11 am or 4 pm, thousands of people get excited about the same thing, watching theNepal Premier League. Cricket, over the past few years, has gained immense popularity among Nepalis as the national team has achieved major milestones, such as playing in the World Cup and retaining ODI status. The cricket fraternity of Nepal has accomplished feats that other sports communities in the country still dream of.\nThe second edition of the NPL features matches under floodlights and allows spectators to watch from the parapet, both happening for the first time in Nepal’s cricketing history, marking yet another milestone.\nIn a country currently experiencing intense political tension, cricket has, to some extent, created an environment where people can share moments of happiness.\nWhile this league continues to draw attention from thousands around the world, its significance for Nepal’s cricket fraternity, along with its challenges and future, remains an important topic of discussion.\nFormer captain of Nepal’s national cricket team, Gyanendra Malla, says that such leagues would first strengthen the status of the Cricket Association of Nepal (CAN), the cricket governing body of Nepal.\n“Once CAN becomes strong, a lot of positive changes will automatically occur in the cricket fraternity,” says Malla, who is also the coach of Karnali Yaks, one of the NPL franchise teams.\nHe further adds that such a league will open avenues to international leagues for Nepali cricketers in the coming days.\nEach team in the NPL includes eight foreign players. In the first edition of the NPL, Nepali players had the opportunity to play with or against big names such as Shikhar Dhawan, Martin Guptill, Ravi Bopara, and James Neesham. Similarly, big names in the second edition include Jason Roy and Sohail Tanvir, Faf du Plessis and others.\n“Gaining and sharing experiences with foreign coaches and cricketers will naturally help in the skill development of our players,” says Malla.\nIn theeight-decade-long cricketing historyof Nepal, this is the first time that such a large franchise cricket league has been organised by CAN.\nThe NPL also held a talent hunt where each team opened a camp and selected the best players, one included in the main squad and others in the development squad, allowing them to train with the team.\n“Exploring new domestic players from different parts of the country who could contribute to the future of Nepal’s national team is another significant step taken by the NPL,” says CAN spokesperson Chhumbi Lama.\nEchoing Malla, Lama says that sharing the same dressing room and playing alongside players from various backgrounds will further enhance the skills of Nepali players.\nBoth Malla and Lama say that, in addition to skill development and making the cricket sector vibrant, leagues like the NPL also help boost tourism and Nepal’s economy.\nNational cricket player Gulshan Jha says that the NPL has become a great learning platform for domestic players.\n“Besides the technical aspects, playing with players from different countries also helps mentally. It allows us to understand other players’ approaches to the game,” says Jha, who currently plays for Karnali Yaks.\nAccording to CAN, on average, around 6,000 spectators watch the NPL live at the TU International Cricket Ground. On Saturdays, the tickets get sold out, meaning 12,000 spectators watch the NPL live at the TU International Cricket Ground. Ticket prices range from Rs 500 to 2,000.Reportedly, the first edition of the NPL was viewed live by around 130,000 to 135,000 spectators.\nWhile the league is getting “bigger and better,” it also faces challenges.\nAccording to the concerned authorities, the first and biggest challenge in hosting the NPL is infrastructure.\n“Although we now have floodlights and well-managed parapets, we still need better infrastructure,” Lama says. “Seeing the growth of Nepali cricket, I am hopeful that we will get good infrastructure very soon.”\nFor the improvement of the league in the future, Malla suggests that the next edition be held in better weather conditions.\n“In the present weather, the pitch condition is not as good as it should be,” he says. “Better pitch conditions would make the matches even more interesting.”\nHe adds that the league would reach another level if it received full sanction from the ICC.",
        "url": "https://english.onlinekhabar.com/nepals-cricket-finds-fresh-energy.html",
        "scraped_at": "2026-01-30T19:45:23.537164"
    },
    {
        "title": "Gold price hits record high at Rs 309,000 per tola",
        "content": "Kathmandu, January 26\nGold prices in the Nepali market have reached a new all-time high.\nAccording to the Federation of Nepal Gold and Silver Dealers’ Association, the price of fine gold rose by Rs 5,200 per tola on Monday to Rs 309,000, the highest ever recorded.\nOn Sunday, gold was traded at Rs 303,800 per tola. Compared to Friday, the price had increased by Rs 2,400 by Sunday.\nLast Friday, gold was priced at Rs 301,400 per tola, up from Rs 292,200 per tola the previous Thursday. On Friday alone, the price had surged by Rs 9,200 per tola.\nSilver prices also increased on Monday. Silver is being traded at Rs 6,765 per tola, up from Rs 6,480 per tola on Sunday.\nOn Friday, silver was priced at Rs 6,190 per tola.\n",
        "url": "https://english.onlinekhabar.com/gold-price-hits-record-high-at-rs-309000-per-tola.html",
        "scraped_at": "2026-01-30T19:45:29.207048"
    },
    {
        "title": "Fake helicopter rescues in Nepal net millions in insurance claims",
        "content": "An investigation by theCentral Investigation Bureau(CIB) of Nepal Police found evidence that chartered helicopter flights, and in some cases even regular commercial flights, were misrepresented as medical evacuations in order to claim insurance money.\nThe findings were disclosed on Sunday at a press briefing at the CIB office in Lazimpat. The bureau’s chief,  Manoj K.C., an Additional Inspector General of police, informed that the so-called rescues were fabricated.\n“Even charter flights were shown as rescues to obtain insurance payments,” K.C. says. “These were not genuine rescues but fake ones.”\nInvestigators said regular flights were also falsely labelled as rescue operations, with fabricated rescue schedules and passenger records submitted to support insurance claims.\nAccording to officials, in some cases, multiple tourists travelling on a single charter flight were billed as having been rescued separately and at different times, a practice known as “single flight, multiple billing.”\nAs per the investigation, trekking tourists returning along the same route after completing their journeys were persuaded to fly back to Kathmandu on chartered helicopters, which were later presented as emergency evacuations.\nThe CIB said it had received multiple complaints in recent years, including one as recently as December 16, 2024, and another on September 28, 2025. The Ministry of Home Affairs also formally requested an investigation into fake rescues earlier this winter.\nAuthorities allege that the scheme involved illegal collusion among trekking and travel companies, helicopter rescue firms, hospitals and tourist guides, primarily targeting foreign trekkers.\nThe CIB is currently investigating fake rescues carried out since 2022.\nAfter conducting a separate investigation over the past two and a half months, including during public holidays, the CIB announced the arrest of six people accused of orchestrating the fraud.\nThose arrested include Jayaram Rimal, owner of Mountain Rescue Service Pvt. Ltd., and its manager, Bibek Pandey, Rabindra Adhikari, owner of Nepal Charter Service, and operations manager Bibek Raj Thapaliya, and Mukti Pandey, owner of Everest Experience and Assistance Pvt. Ltd., along with its manager, Subash K.C.\nAll six are affiliated with three companies that investigators say were involved in at least 317 fake rescues.\nAccording to the CIB, the Mountain Rescue Service reported evacuating 1,248 tourists between 2022 and 2025. Of those, 171 were found to be fraudulent, resulting in insurance claims totalling $10.31 million.\nNepal Charter Service reported 417 rescues, of which 75 were found to be fake, with insurance payouts of approximately $8.23 million.\nEverest Experience and Assistance reported 601 rescues, including 71 fraudulent cases, with insurance claims amounting to $1.15 million.\nIn total, investigators estimate that the three companies obtained $19.69 million through fake rescue claims.\n“This is preliminary data, and the figures could increase,” a CIB investigation officer says toOnlinekhabar.\nAs fake rescues increased, insurance companies covering foreign trekkers began suspending premium payments, according to CIB officials.\nAt least three insurance companies have completely halted premium payments, citing mounting losses from fraudulent claims. Some claims submitted by rescue companies were also rejected outright.\nThe six suspects are being investigated under multiple provisions of Nepal’s criminal code, including organised crime, forgery, fraud and offences against the state.\nInvestigators said the case falls under Section 51 of the Criminal Code, which prohibits acts detrimental to national interest, as well as Section 249 (fraud), Section 253 (illegal financial gain), and Section 276 (document-related offenses).\nAuthorities allege that fake medical reports and helicopter invoices were forged, fraudulent insurance bills were submitted, and tourists were falsely warned of life-threatening altitude sickness to justify evacuations, damaging Nepal’s international reputation in the process.\nThe case is being treated as an organised crime involving collusion among trekking agencies, hospitals and helicopter companies. Money laundering charges may also apply.\nForeign tourists travelling to Nepal typically purchase insurance before trekking in high-altitude regions. Investigators say travel agencies first verified the tourists’ insurance policies before planning fake rescues.\nOnce in the mountains, guides allegedly exaggerated minor symptoms commonly associated with altitude, pressuring tourists into helicopter evacuations that were medically unnecessary.\nIn many cases, officials said, tourists would recover simply by descending to a lower altitude, yet were still flown to Kathmandu and taken to specific hospitals favoured by the rescue operators.\nRescue companies and hospitals then submitted separate or lump-sum bills to insurance providers.\nWhile the current investigation covers cases since 2022, authorities acknowledged that fake rescues had been reported as early as 2018. However, the lack of documentation has made older cases difficult to prosecute.\nIn 2017, a travel assistance firm reported that nearly 35 percent of rescues were fraudulent. That same year, reports emerged of trekkers being deliberately made ill through food contamination to trigger evacuations and earn commissions.\nA government investigation committee formed in 2018 recommended further police inquiry and led to the introduction of new rescue monitoring guidelines. But officials say the absence of records has hindered retrospective investigations.\nThe CIB warned that fake rescues risk tarnishing Nepal’s international image and could eventually make the country a “no-go destination” for tourists.\nOfficials also cautioned that fraudulent evacuations could delay or obstruct genuine rescue operations, potentially putting lives at risk.",
        "url": "https://english.onlinekhabar.com/fake-helicopter-rescues-in-nepal.html",
        "scraped_at": "2026-01-30T19:45:33.621042"
    },
    {
        "title": "Turkish Airlines aircraft returned to parking after emergency halt on runway",
        "content": "Kathmandu, January 25\nA Turkish Airlines flight from Kathmandu to Istanbul was halted on the runway and returned to the parking bay. The aircraft, operating flight TK-727, was scheduled to depart Kathmandu at 12:35 pm.\nAccording to Tribhuvan International Airport Acting Director General Tek Nath Sitoula, the aircraft had already begun its take-off run after receiving clearance when an indicator signalled a technical issue, prompting the crew to stop the aircraft.\n“After an indication showed a problem, the aircraft, which had already started its run, was halted and brought back,” he said, adding that the plane will resume its flight after a technical inspection.",
        "url": "https://english.onlinekhabar.com/turkish-airlines-aircraft-returned-to-parking-after-emergency-halt-on-runway.html",
        "scraped_at": "2026-01-30T19:45:38.481188"
    },
    {
        "title": "Two-Thirds of current lawmakers unlikely to return in the new House of Representatives",
        "content": "Kathmandu, January 26\nNearly two-thirds of the current members of the House of Representatives (HoR) will not be seen in the new parliament to be formed after the Falgun 21 election. Of the lawmakers who served in the House dissolved last Bhadra, around 170 are not even in the race this time.\nIn some constituencies, outgoing lawmakers are competing against one another. Even if incumbent candidates manage to win in as many seats as possible, it is almost certain that more than two-thirds of the members, both from the direct and proportional systems, in the next House will be new faces.\n“Yes, looking at the candidates and their backgrounds, it is clear that around two-thirds of those elected will be new,” says former Federal Parliament Secretary-General Manohar Prasad Bhattarai. “Even among those contesting now, not all incumbents will win. Many will exit politics through the election itself, which could further increase the number of new lawmakers.”\nOf the 165 incumbent lawmakers elected through the direct system, 70 are not candidates this time. Among the 110 proportional representation lawmakers, at most only 10 are in the race. There is no guarantee that nearly all 100 incumbents elected in 2079 BS who are contesting again will win. Eight former lawmakers are competing against one another.\nSeveral senior leaders from major parties are not contesting. In the Nepali Congress, former party president Sher Bahadur Deuba, former vice-president Dhanraj Gurung, and current vice-president Bishwo Prakash Sharma are not in the race. Leaders, including Prakash Man Singh and Arzu Rana, are also not contesting. In the UML, former deputy general secretary Top Bahadur Rayamajhi, Yogesh Bhattarai, and Bidya Bhattarai are out of the race.\nIn Jumla, Jhapa–2, Sarlahi–4, and Dhanusha–3, multiple incumbent lawmakers are competing against one another, meaning only one from each constituency will be elected. At least six incumbents from these areas will not return to the House.\nIn Jhapa–2, former Speaker Devraj Ghimire, Congress proportional lawmaker Sarita Prasain, and former Deputy Speaker Indira Rana Magar are contesting; two of them will not make it to the House. In Sarlahi–4, only one of the Congress leaders, Gagan Thapa and the Rastriya Swatantra Party (RSP) candidate, Amresh Kumar Singh, will become a lawmaker.\nIn Dhanusha–3, UML incumbent Juli Kumari Mahato, Congress proportional lawmaker Bimalendra Nidhi, and RSP incumbent Manish Jha are competing; only one will return after Falgun 21. In Jumla, at least one of RPP’s Gyanendra Bahadur Shahi and RSP’s Binita Kathayat will fail to enter the House.\nNone of the UML lawmakers elected through proportional representation last time are on either the direct or proportional lists this time. However, those elected before 2079 BS have sought safety on proportional lists.\nRam Bahadur Thapa, who was not in the House after the new constitution, is on the proportional list, while Padma Aryal, elected in 2074 BS, also appears on the list. UML, Congress, and RSP did not repeat their previous proportional lists.\nFrom Congress, only Dr Prakash Sharan Mahat and Bimalendra Nidhi from the previous proportional list are in direct contests. In the Maoist Centre and other allied groups forming the NCP, the proportional lists also feature new faces.\nFrom the RSP, six lawmakers previously elected through proportional representation are now contesting direct seats, including Dol Prasad Aryal (Kathmandu–9), Nisha Dangi (Jhapa–1), Binita Kathayat (Jumla), Indira Rana Magar (Jhapa–2), and Manish Jha (Dhanusha–3). Former RSP member Santosh Pariyar is on the proportional list of the Progressive Democratic Party, while Sumana Shrestha is not contesting this time.\nIn Taplejung, UML has fielded Kshitij Thebe in place of former lawmaker Yogesh Bhattarai. In Panchthar, Aindra Sundar Nembang replaces Basanta Nembang. In Ilam–1, Kaji Man Kagate has been nominated instead of former UML lawmaker Mahesh Basnet.\nIn Jhapa–1, Congress has nominated Keshav Raj Pandey in place of former vice-president Bishwo Prakash Sharma. In the remaining four Jhapa constituencies, previously elected candidates are contesting again.\nIn Sankhuwasabha, Tehrathum, and Bhojpur, Congress and the Maoist Centre did not field their previously elected lawmakers. Congress nominated Dipan Kumar Shrestha instead of Dipak Khadka in Sankhuwasabha, Santosh Subba instead of Sita Gurung in Tehrathum, and the unified NCP nominated Ajambar Rai instead of Sudan Kirati in Bhojpur.\nIn Morang, two incumbent lawmakers are not contesting. Congress nominated Khadga Bahadur Phago instead of Dig Bahadur Limbu in Morang–1, while UML nominated Dilip Kumar Agrawal instead of Rishikesh Pokharel in Morang–2.\nIn Sunsari–1, the Janata Samajwadi Party did not field a candidate to replace Ashok Rai, while in Sunsari–2 UML nominated Sujan Lama instead of Bhim Acharya.\nIn Solukhumbu, Khotang, and Okhaldhunga, previously elected lawmakers are not contesting. UML nominated Kalpana Rai instead of Manbir Rai in Solukhumbu, while Hari Roka received the ticket in place of the Maoist Centre’s Ram Kumar Rai. In Okhaldhunga, Congress nominated Kumar Luintel instead of Ram Hari Khatiwada.\nIn Udayapur–1, Congress nominated Bidur Basnet instead of Dr Narayan Khadka. In Saptari–1, Shyam Sundar Sardar is contesting in place of former JSP lawmaker Naval Kishor Sah Sudi.\nIn Siraha, all four constituencies have incumbent lawmakers contesting, but two have changed constituencies or parties. In Siraha–2, Raj Kishor Yadav has moved to Siraha–4, while Birendra Prasad Mahato is contesting from Siraha–4 under the Janamat Party.\nIn Dolakha, Ramechhap, and Sindhuli–1, previously elected lawmakers are not contesting. In Sindhuli–2, only NCP’s Lekhnath Dahal is repeating.\nIn Mahottari, three of four constituencies have former lawmakers contesting. In Mahottari–3, Mahanta Thakur is set to become a National Assembly member, ensuring a new face in the House.\nIn Bagmati Province’s Rasuwa, Dhading, and Nuwakot, incumbents are contesting, except in Dhading–2 where Congress nominated Ramesh Prasad Dhamala instead of Ram Nath Adhikari. In Nuwakot–2, Congress lawmaker Arjun Nar Singh KC is on the proportional list.\nOf the 15 constituencies in the Kathmandu Valley, at least five will elect new lawmakers as incumbents are not contesting. Congress nominated Prabal Thapa instead of Prakash Man Singh in Kathmandu–1. In Kathmandu–2, RSP lawmaker Sobita Gautam is contesting from Chitwan–3.\nCongress has fielded new candidates in Kathmandu–3, Kathmandu–10, and Bhaktapur–2. UML nominated Ajay Kranti Shakya instead of Krishna Gopal Shrestha in Kathmandu–9. Lalitpur’s three constituencies still have incumbents contesting.\nBoth constituencies in Kavre will see new lawmakers, as Surya Man Dong and Gokul Baskota are not contesting. In Sindhupalchok–2, Congress nominated Banshalal Tamang instead of Mohan Basnet.\nIn Kaski, UML did not re-nominate incumbents in two constituencies, fielding Bain Bahadur Chhetri in Kaski–1 and Rashmi Acharya in Kaski–2. In Tanahun, both incumbents are contesting again.\nIn Syangja, Congress has fielded Bharatraj Dhakal and Bhagwat Prakash Mall as new candidates. In Arghakhanchi, UML nominated Pitambar Bhusal after Top Bahadur Rayamajhi was jailed in a fake refugee case.\nIn Rupandehi, new faces are almost certain in three of five constituencies. UML nominated Dadhiram Neupane instead of Chhabilal Bishwakarma in Rupandehi–1, while Bishnu Poudel is contesting in Constituency 2.\nSeveral incumbents across Kapilvastu, Nawalparasi, and other districts are not contesting, ensuring new representation.\nFormer Secretary-General Bhattarai says that even with a large number of new lawmakers, parliamentary procedures can be learned quickly through practice and study.\n“Concerns that parliamentary practice will weaken with new lawmakers are nothing new,” he says. “Past experience shows that those with strong oratory skills and political grounding adapt quickly. Active lawmakers can become effective within four to six months.”\nHe adds that an influx of new lawmakers could help curb parliamentary distortions and strengthen discipline, provided party leadership enforces accountability and refrains from protecting those involved in criminal activities.\n“Publicly questioning old lawmakers exiting and new ones entering can raise hopes for controlling parliamentary malpractice,” he says. “Whether this becomes an opportunity for political cleansing depends largely on party leadership and how responsibly they guide their representatives.”",
        "url": "https://english.onlinekhabar.com/two-thirds-of-current-lawmakers-unlikely-to-return-in-the-new-house-of-representatives.html",
        "scraped_at": "2026-01-30T19:45:42.649672"
    },
    {
        "title": "18 new members elected to National Assembly",
        "content": "Eighteen new faces have been elected to the National Assembly, including a mix of experienced leaders, first-time parliamentarians, youth, and representatives from inclusive groups.\nElections were held on Sunday for 18 of the 19 seats whose terms are set to expire on Falgun 20. The Nepali Congress, CPN-UML, and Loktantrik Samajwadi Party (LSP) contested the election in alliance, while the Nepal Communist Party contested independently. Candidates backed by the alliance emerged victorious.\nMembers of provincial assemblies and chiefs and deputy chiefs of local governments serve as voters in National Assembly elections. Across all seven provinces, there are 550 provincial assembly members. Among local levels, there are 1,506 voters, including mayors, chairpersons, and their deputies from 753 local units. The term of the newly elected National Assembly members will begin on 21 Falgun.\nSeveral of those elected on Sunday have previously served in the House of Representatives, while others are completely new to parliamentary politics.\nThose elected to the National Assembly who have previously served as members of the House of Representatives include Mahanta Thakur, Ram Kumari Jhakri, Sunil Bahadur Thapa, and Lalit Jung Shahi.\nEighty-three-year-old Mahanta Thakur, elected from Madhesh Province, was a member of the dissolved House of Representatives. A multiple-time lower house lawmaker, he has entered the National Assembly in the later phase of his political career.\nThakur entered parliamentary politics in 1991 after winning the election from Sarlahi Constituency No. 5 as a Nepali Congress candidate and later served as deputy speaker. He won again from Sarlahi in the 1994 mid-term election. He lost in the 2008 election but became a lawmaker through cabinet nomination. He was defeated again in 2013 but won elections from Mahottari-3 in 2017 and 2022. This time, he has moved from the House of Representatives to the National Assembly.\nRam Kumari Jhakri, elected from Lumbini Province, is also a former member of the House of Representatives. She was elected under the proportional representation system in 2017 but lost the 2022 election. She has now been elected to the National Assembly.\nBorn on May 10, 1978, in Gulmi, Jhakri rose to prominence through student politics under ANNFSU.\nFrom Karnali Province, Lalit Jung Shahi is a former Constituent Assembly member. Born on November 15, 1955, he is a resident of Chandannath Municipality-5, Khalanga, Jumla.\nInfluenced by the ideology of BP Koirala, Shahi has been active in politics for decades. He unsuccessfully contested the first Constituent Assembly election in 2008 as a rebel candidate against his own party’s nominee but remained in the party. He was elected from Jumla in the second Constituent Assembly election in 2013 and played a role in drafting the Constitution of Nepal 2015. He lost the 2022 provincial assembly election but has now been elected to the National Assembly. After his election, Shahi pledged to help bring the constitution back on track, saying it had deviated from its intended course.\nSunil Bahadur Thapa, elected unopposed to the National Assembly from Koshi Province, is the son of former prime minister Surya Bahadur Thapa.\nThe 66-year-old has prior experience as a federal lawmaker and minister. He was directly elected to the Constituent Assembly from Dhankuta-2 in 2013 as a Rastriya Prajatantra Party candidate. In May 2017, he served as Minister for Commerce and Supplies in Prime Minister Sher Bahadur Deuba’s cabinet.\nHowever, the last two House of Representatives elections were unsuccessful for Thapa. He lost the 2017 and 2022 elections from Dhankuta to UML’s Rajendra Kumar Rai. He left RPP in 2020 and joined the Nepali Congress, later becoming a central committee member through the party’s 14th general convention. From Chaitra 2079 BS to Chaitra 2082 BS, he served as chief political adviser to President Ram Chandra Paudel.\nThapa was elected unopposed after his main rival, Nepal Communist Party candidate Hemraj Ghimire, failed to reach the election officer’s office on time during nomination registration on Poush 23.\nBorn on April 13, 1959, in Pakhribas, Dhankuta, Thapa previously worked in various countries under the United Nations. He entered active politics after resigning from his post at the UN High Commissioner for Refugees in Sudan.\nAnother National Assembly member elected from Koshi Province is Roshni Meche, who represents the marginalised Meche community.\nRosani defeated Nepal Communist Party candidate Namita Nyaupane in Sunday’s election. With her victory, the door has opened for her to take the lead in shaping federal policies related to marginalised communities.\nThe Meche community, which resides in areas including Mechinagar, Birtamod, Haldibari, and Kachankawal in Jhapa, currently receives a monthly social security allowance of Rs 4,000. Rosani’s election is considered a moment of pride for the community.\nShe previously worked at the secretariat of then prime minister KP Sharma Oli. A resident of Mechinagar-12, Jhapa, Rosani entered politics through the UML-affiliated Democratic Indigenous Nationalities Federation. She holds a master’s degree in sociology and a bachelor’s degree in law. Over the next six years, she plans to raise the voices of marginalised and minority communities in the federal parliament.\nApart from Mahanta Thakur, three others have been elected to the National Assembly from Madhesh Province: Dharmendra Paswan and Ranjit Karn of the Nepali Congress, and Rekha Jha of CPN-UML.\nDharmendra Paswan is a Dalit rights activist known for raising his voice against discrimination, injustice, and exclusion. The 54-year-old leader from Rautahat is regarded as disciplined, people-oriented, and living a simple lifestyle. He studied political science up to the bachelor’s level and has experience working with various non-governmental organisations. He has also served as general secretary of the Dalit Association and has pledged to work for the economic and social development of the Dalit community during his tenure.\nRanjit Karn is a former central president of the Nepal Students’ Union. A resident of Rajbiraj, he has been active in the Nepali Congress since his student days and was elected under the minority quota from Madhesh Province.\nRekha Jha of CPN-UML has also been elected to the National Assembly from Madhesh.\nNewly elected member Som Portal says he will raise youth-related issues in the National Assembly. Elected from Koshi Province under the Dalit cluster, Portal said he would advocate for both Dalit concerns and youth issues, as mandated by his party.\nHe noted that the National Assembly was previously viewed mainly as a chamber to honour senior and experienced leaders, but stressed the need for meaningful youth participation. Portal began his political journey at the ward committee level and worked through local, district, and provincial responsibilities before reaching the National Assembly.\nBorn in Falgun 2035 BS, Portal has experience in local governance and development and served as chair of the Jhapa District Coordination Committee from 2017 to 2022.\nFrom Bagmati Province, Geeta Devkota of the Nepali Congress and Dr Prem Dangal of CPN-UML have been elected. Dangal, a UML central committee member, is a resident of Gokarneshwar-5, Kathmandu. He has worked in various roles within ANNFSU and party committees and previously served as chair of the All Nepal Peasants’ Federation. He has led regional farmers’ organisations and authored several books on food sovereignty, neoliberalism, climate change, sustainable development, and the Nepali farmers’ movement.\nDevkota, born in 1971, has been active in politics since 1987 through the Nepal Students’ Union. She was elected a central committee member of the Nepali Congress at its 14th general convention and currently serves as vice-chair of the Beekeepers Farmers Federation.\nFrom Gandaki Province, Jagat Timilsina of the Nepali Congress and Smriti Devkota of CPN-UML have been elected.\nTimilsina was a lecturer at Tribhuvan University’s management faculty and has served as president of the Congress-affiliated Democratic Professors’ Association since 2016. A resident of Shuklagandaki-7, Tanahun, he had not previously held a party post.\nSmriti Devkota entered the National Assembly after losing three consecutive elections. She had contested the 2017 local election as a UML candidate for deputy mayor of Gorkha Municipality and the 2022 mayoral election from the same municipality, but lost both. She was again nominated for the National Assembly election in 2024 and has now succeeded.\nFrom Lumbini Province, Vasudev Jangali and Chandra Bahadur KC of the Nepali Congress have been elected. Jangali hails from Dang, while KC is from Gulmi.\nFrom Karnali Province, Lalit Jung Shahi of the Nepali Congress and Mina Rakhal of CPN-UML have been elected. Rakhal, a resident of Dailekh, was a proportional representation member of the Karnali Provincial Assembly in 2017 and later became a UML central committee member through the party’s 11th general convention.\nFrom Sudurpaschim Province, Khamba Bahadur Khati of the Nepali Congress and Leela Bhandari of CPN-UML have been elected. Khati is a former general secretary of the Nepal Bar Association and a former attorney general, while Bhandari is a leader with a Maoist background.\n",
        "url": "https://english.onlinekhabar.com/18-new-members-elected-to-national-assembly.html",
        "scraped_at": "2026-01-30T19:45:45.602896"
    },
    {
        "title": "Balen’s Eastern tour and the politics of presence",
        "content": "Senior leader of the Rastriya Swatantra Party (RSP), Balen Shah, has returned to Kathmandu after an election campaign and religious tour. Shah had arrived in Damak, Jhapa, on Tuesday tofile his candidacyfor the House of Representatives after resigning from his post as Mayor of Kathmandu Metropolitan City.\nHe travelled from Janakpur to Damak in a blackLand Rover Defender, continuing in the same vehicle to Phungling, the district headquarters of Taplejung. On Saturday evening, as he made his way back to Kathmandu, the same vehicle carried him as far as Biratnagar Airport. The journey, however, drew criticism; the vehicle was widely described as an expensive car belonging to a businessman.\nAfter arriving in Damak on Tuesday, Shah stayed in Birtamod following his nomination registration. On Wednesday, he returned to Damak and met party cadres. He held discussions with candidates from Morang, Sunsari, and Jhapa. On Thursday morning, he reached Ilam Bazaar and went door-to-door with candidates.\nHe campaigned in Panchthar, asking for votes and meeting supporters along the way. En route to Taplejung, he stopped at various junctions where cadres and well-wishers had gathered, acknowledging some with folded hands, others with handshakes, before arriving in Phungling. From there, he travelled via Sano Phedi and, on Friday morning, visited the Pathibhara Temple. Afterwards, he returned to Taplejung, where he continued meeting supporters.\nFrom Taplejung, Shah travelled to Panchthar and reached Myanglung Bazaar in Terhathum on Friday evening via the Mid-Hill Highway. He stayed overnight in Myanglung and on Saturday morning visited a temple.\nIn the Devithan area of Myanglung, he interacted with local voters and sought votes for RSP’s Terhathum candidate, Surendra Karki. He said that real problems can only be understood after directly experiencing the geography, climate, and daily life of voters in Terhathum.\n“You can read about Terhathum on paper, you can find it on Wikipedia,” Shah says, “but only by coming here, sitting on this soil, and talking to the people can you understand the reality of this place. When raising issues in Parliament tomorrow, it should not be based on assumptions, but on lived experience.”\nHe also visited Cho Lung Park in Basantapur, Terhathum, and reached Mudhe Bazaar in Sankhuwasabha, which shares a border with Terhathum. At Mudhe Bazaar of Dharmadevi Municipality–3, in the presence of RSP candidate Mingma Sherpa, he spoke about the beauty of eastern Nepal and mentioned Rudraksha.\n“To be honest, this is my first time in Sankhuwasabha,” he says while addressing voters briefly. “Sankhuwasabha is known inside and outside for Rudraksha. Just as this is my first visit here, I urge the candidate to create an environment that brings three crore Nepalis to this place.”\nHe also stressed the need to develop tourism and agriculture. “Not everyone knows how beautiful this eastern region is. You only realise it after coming here,” he says.\nAfter meeting voters in Mudhe Bazaar near Myanglung, supporters welcomed him in Hile of Dhankuta. He was also welcomed in Dhankuta Bazaar. RSP supporters welcomed him in Dharan, Tarahara, and Itahari. Supporters gathered in front of Biratnagar Airport chanted slogans in his favour.\nAt some places, he shook hands with supporters and accepted khada, garlands, and bouquets; at others, he greeted people while seated in his vehicle, and at times waved to voters from the rooftop of the vehicle. However, he did not speak to journalists anywhere.\nRSP leaders say Shah returned after creating a strong campaign atmosphere for the party’s election symbol, the bell, across the districts of Koshi Province.\n“He has returned after touring eastern districts in one phase, and the atmosphere has been positive,” says Kedar Chapagain, chair of RSP Kamal Rural Municipality. “He will return, after which preparations are underway for him to focus on Jhapa Constituency No. 5 and also participate in campaigns in other areas.”\nDuring his six-day stay, Shah visited Morang, Sunsari, Jhapa, Ilam, Panchthar, Taplejung, Terhathum, Sankhuwasabha, and Dhankuta.\nAfter resigning as Mayor of Kathmandu Metropolitan City and joining RSP, Shah has arrived in Jhapa Constituency No. 5 to contest against CPN-UML Chair and four-time Prime Minister KP Sharma Oli.\nShah is RSP’s prime ministerial candidate, while UML has also fielded Oli as its prime ministerial candidate. As both parties have put forward candidates aspiring to become the next prime minister, the electoral contest in Jhapa has intensified. Its impact is being felt across Koshi Province and nationwide.\nUML Chair Oli had also met voters and party cadres before returning to Kathmandu via Biratnagar Airport on Friday afternoon. Shah returned to Kathmandu via Biratnagar Airport on Saturday evening.\nBefore returning to Kathmandu, Shah held discussions with RSP candidates and leading party workers at Purple Haze Café near Biratnagar Airport. As a large crowd of supporters gathered to see Shah after he arrived quietly in Biratnagar, police had a difficult time managing the situation.",
        "url": "https://english.onlinekhabar.com/balens-eastern-tour.html",
        "scraped_at": "2026-01-30T19:45:48.356195"
    },
    {
        "title": "Premature online election ads raise code of conduct concerns",
        "content": "As the date for the House of Representativesve Election is approaching, digital campaigning by candidates in Nepal has surged significantly.\nAccording toMeta’s Ad Library, more than 500 advertisements under the categories of issues, elections, and politics were run from Nepal in the last 30 days (from December 24, 2025, to January 22, 2026).\nDuring this period, around 104 election-focused advertisements were placed on Meta platforms through more than 100 different accounts.\nAn estimated total of around USD 1,900 was spent on these ads. Of the advertisers, 97 spent USD 100 or less.\nThe money paid for such advertisements goes directly to Meta. These ads are displayed across Facebook, Instagram, Messenger, and Meta’s Audience Network, which includes third-party apps and websites partnered with Meta.\nWhen placing ads on Meta, advertisers typically target users based on age, interests, behaviour, geography, and other factors.\nAccording to the Meta Ad Library, the Rastriya Paribartan Party ranks first in election-related advertising on Meta platforms. In the last 30 days, the party ran 11 advertisements, spending USD 597.\nThese advertisements have collectively been viewed at least one million times. The content includes information about the party and its activities, interviews with families of Gen Z martyrs, speeches by party leaders, and calls for votes.\nThe second-highest spender is Shree Gurung, who spent USD 182 over the same period. His advertisements focus on election promises. He is a candidate from the Ujyalo Nepal Party contesting from Kathmandu-5.\nOther notable spenders include Rastriya Paribartan Party Okhaldhunga, RSP Coverage, Narayankaji Followers, the Dynamic Democratic Party, and Sunil Kumar Sharma.\nA comparative review of Meta Ad Library data shows that most of these advertisements are still active, meaning they are continuing to appear in users’ feeds.\nHowever, some advertising accounts have since been deleted. For instance, an account that promoted a post by Balen Shah seeking votes for Jhapa-5 has been removed now.\nSome election-focused ads have been run by agents rather than candidates or parties. For example, a page named MPG Solution ran advertisements promoting its own services with messages such as “Make your election campaign more effective.”\nSimilarly, some ads have been used to attack or criticise specific political parties or leaders.\nGeographically, the highest spending has come from the Bagmati Zone, where more than USD 1,024 has been spent. This is followed by Koshi, Narayani, Mechi, Janakpur, Lumbini, Gandaki, and other regions.\nHowever, when comparing spending over 90 days, 30 days, seven days, and one day, the overall expenditure appears to be decreasing progressively.\nAs the election approaches, aggressive campaigning on social media has become more visible, an area that falls under the jurisdiction of the Election Commission’s code of conduct.\nAccording to Election Commission Information Officer Suman Ghimire, the Commission closely monitors advertisements on digital platforms.\n“Since the spending limit for each parliamentary candidate is set at NPR 2.5 million, the Commission reviews what falls within this limit, including social media advertising,” Ghimire says.\nHowever, he noted that running boosted campaigns on social media at this time would be a violation of the election code of conduct.\nThe Election Commission has allocated time for parties to begin campaigning only from February 16, and any ads run before that would be against the code, Ghimire says.\n“Political parties are not allowed to carry out election campaigns until the 16th. If it is happening now, the Election Commission will take action,” Ghimire toldOnlinekhabar.\nCampaigning carried out after the permitted date will be reviewed by the Commission based on expenditure. Explaining the process, Ghimire said, “Just as you can view reports from Meta, we will do the same. Since this also falls under election expenses, candidates must ensure that all spending remains within the NPR 2.5 million limit.”\nBeyond this, the Election Commission will also use software to monitor electronic media.\nAccording to Ghimire, the software, provided with support from UNDP and The Asia Foundation, will screen social media content.\nIf any issues are identified, the Commission will coordinate with the respective social media companies to remove the content. Those spreading misinformation will also be kept under special surveillance.\nHowever, the Commission appears less clear about monitoring social media spending carried out by individuals or entities other than the candidate or their official campaign team.\nThe code of conduct does not clearly specify what action should be taken if someone else runs a social media campaign in support of a candidate. Nevertheless, Ghimire said the Commission would account for such advertisements as well and include all forms of advertising in its assessment, even though campaign promotions are increasingly being run in the names of foundations and private individuals. The Meta Ad Library shows many political campaigns being conducted through such handles.\nThe election code of conduct prohibits campaigning through multiple handles.\nIt states: “Political parties or candidates shall not conduct or cause to be conducted any publicity through online web pages, TV scrolling, displays in shopping malls, call centres, bank ATM messages, street dramas, or similar media.”\nHowever, it adds that having campaign materials on a maximum of one personal or official website of a political party or candidate will not be restricted.\nThat said, the Election Commission has been working with companies such as Meta and TikTok to regulate such issues since the 2022 local-level elections.\nAfter Facebook included Nepal in its Meta Ad Library, regulation became easier, as Meta began publicly providing details of political, social, and election-related advertisements and expenditures.\nGhimire told Onlinekhabar that the Commission is once again attempting to collaborate with Meta for regulation during this election.\nAccording to AI expert Dovan Rai, maintaining a presence on digital platforms is no longer unusual. Since voters themselves are on digital platforms, campaigning there is natural.\nHowever, Rai stressed the need to assess how well election codes of conduct are being followed online. She noted that practices such as creating fake IDs and purchasing fake views are on the rise and require close monitoring.\n“Showing artificial reach is illegal. Spreading misinformation and disinformation must not happen,” Rai says. “At the same time, campaigning on social media within legal boundaries is a necessity of the times. When voters are in the digital space, campaigning there is not inherently wrong.”",
        "url": "https://english.onlinekhabar.com/online-election-code-of-conduct.html",
        "scraped_at": "2026-01-30T19:45:51.810420"
    },
    {
        "title": "Gold price hits Rs 309,000 per tola",
        "content": "Kathmandu, January 27\nThe gold and silver prices have set new records in the local market today. The Federation of Nepal Gold and Silver Dealers’ Association has fixed the price of hallmark gold at Rs 309,000 per tola, while the price of silver at Rs 6,870 per tola today.\nThe foreign media have stated that the gold per ounce is traded at 5,073 US dollars, while a similar amount of silver is traded at 109 US dollars in the international market today.",
        "url": "https://english.onlinekhabar.com/gold-price-hits-rs-309-thousand-per-tola.html",
        "scraped_at": "2026-01-30T19:45:56.288276"
    }
]