[
    {
        "title": "Forty injured in bus mishap on Narayangadh-Muglin road section",
        "content": "Chitwan, Jan 30: A bus accident occurred on the Narayangadh–Muglin road section, injuring 40 people. Among the injured, three have returned home after treatment.\nThis morning, the bus with number plate, Lumbini Province 02-100 Kha 0460, travelling from Dang to Kathmandu, overturned on the road at Ghumaune of Bharatpur Metropolitan City-29.\nSuperintendent of Police Govinda Puri of the District Police Office informed that other injured individuals are receiving treatment at various hospitals in the district.\nAccording to him, among the injured, 15 are being treated at Maulakalika Hospital, Bharatpur, 17 at Old Medical College, Bharatpur, and five at Chitwan Medical College, Bharatpur. (RSS)",
        "url": "https://risingnepaldaily.com/news/74899",
        "scraped_at": "2026-01-30T20:28:39.381078"
    },
    {
        "title": "Home Ministry shares model of inclusive electoral management",
        "content": "Kathmandu, Jan 30: The Ministry of Home Affairs has shared a model on how the electoral management could be made effective with multi-stakeholders' representation and engagement.\nIn order to conduct the upcoming election in a free, impartial and calm atmosphere, the subordinate bodies in districts are issued a concept of the electoral management that takes onboard the political parties, civil society members and intellectuals.\nThe model focuses on strengthening coordination and collaboration up to the ward level to ensure a systematic election. The Ministry introduced it, considering the essential roles the political parties, civil society members, the media, the private sector, and the intellectual guild could play in all phases of the electoral management.\nThe Ministry has already written to all District Administration Offices, instructing them to implement the approach. According to Ministry Spokesperson Anand Kafle, the concept was shared with the objective incorporating political representatives, officials, and intellectuals at the ward level and encouraging them to take ownership of the election process. This, he hoped, would help to create an environment conducive to holding upcoming House of Representatives (HoR) elections in a free and fair manner.",
        "url": "https://risingnepaldaily.com/news/74914",
        "scraped_at": "2026-01-30T20:28:40.305755"
    },
    {
        "title": "Heavy snowfall covers pastures, farmers find tough time to manage fodder for mountain goats in Mustang",
        "content": "Mountain goats being taken to safer place after heavy snowfall. Photo: Hari Krishna Sharma/TRN\nBy Hari Krishna Sharma,Mustang, Jan 30: Heavy snowfall has occurred around the yak sheds of yak herder Pasang Gurung in Nilekangchung of Lomanthang Rural Municipality, where nearly one hundred yaks are kept.\nDue to the excessive snowfall, around four feet of snow has accumulated in the grazing areas, making it extremely difficult to manage the necessary fodder for the livestock.\nLeading yak herder of Mustang, Gurung, said that calves have been kept safely inside the sheds.\nAround 600 yaks belonging to yak herders of Lomanthang are currently grazing at an altitude of about 3,700 meters above sea level.",
        "url": "https://risingnepaldaily.com/news/74908",
        "scraped_at": "2026-01-30T20:28:41.328268"
    },
    {
        "title": "Capital expenditure contracts while finance expense goes up",
        "content": "By TRN Online, Kathmandu, Jan 30: Capital expenditure contracted as of the 2nd quarter of the current fiscal year (FY).  According to the 2nd quarter report of the current fiscal year (FY) published by the Ministry of Finance, the capital expenditure is contracted by 22 per cent compared to the same period of the previous FY.\nIn the 2nd quarter of the current FY, the capital expenditure amounted to Rs 47.54 billion which is lower than that of the same period of the previous FY of Rs 58.18 billion.\nMeanwhile, current expenditure and finance expenses went up in the 2nd quarter.\nThe report showed that the government’s total spending in the current FY is higher than the previous FY. In the current FY, total expenditure thus far is 46.06 per cent which is higher than previous 10.75 per cent. In the current FY, the recurrent expenditure is 40.82 percent, in the same period of the previous FY, it was recorded 37.47 per cent. Similarly, the current finance expenses is 99.93 per cent which is higher than 46.64 per cent of the same period of the previous FY.",
        "url": "https://risingnepaldaily.com/news/74913",
        "scraped_at": "2026-01-30T20:28:43.991029"
    },
    {
        "title": "President Paudel embarking on official visit to Japan on February 1",
        "content": "President Ramchandra Paudel\nKathmandu, Jan 30: President Ramchandra Paudel is embarking on an official visit to Japan from February 1-4, leading a Nepali delegation.\nHe will leave for Japan on Nepal Airlines plane on February 1 and is visiting Japan at the invitation of Japanese government on the occasion of the 70th anniversary of the establishment of Nepal-Japan diplomatic relations, said Foreign Secretary Amrit Bahadur Rai.\nThe President is scheduled to return home on February 4.\nDuring the visit, President Paudel is scheduled to pay courtesy call on Japan's Emperor Naruhito at Tokyo-based Imperial Palace on February 3. Similarly, President Paudel and Japan's Prime Minister Takaichi Sanae will hold meeting on the same day, added Rai.",
        "url": "https://risingnepaldaily.com/news/74907",
        "scraped_at": "2026-01-30T20:28:45.391736"
    },
    {
        "title": "Venezuela’s acting president signs oil industry overhaul, easing state control to lure investors",
        "content": "(AP Photo/Ariana Cubillos)\nCARACAS, Venezuela, Jan 30, 2026 (AP): Venezuela’s acting President Delcy Rodríguez on Thursday signed a law that opens the nation’s oil sector to privatization, reversing a tenet of the self-proclaimed socialist movement that has ruled the country for more than two decades.\nThe reform will undoubtedly be her government’s signature policy as it positions the oil sector – Venezuela’s engine – to lure the foreign investment needed to revamp a long-crippled industry. Rodríguez enacted the measure less than a month after the brazen seizure of then-President Nicolás Maduro in a U.S. military attack in Venezuela’s capital, Caracas.\nRodríguez, facing oil workers and ruling-party supporters, signed the bill less than two hours after the National Assembly approved it. At the same time, the U.S. Department of Treasury officially began to ease punishing economic sanctions on Venezuelan oil, which were imposed by the first Trump administration, and expanded the ability of U.S. energy companies to operate in the South American nation.\nRodríguez on Thursday also spoke with U.S. President Donald Trump and Secretary of State Marco Rubio, who a day earlier explained to U.S. senators in a hearing how the administration is planning to handle the sale of tens of millions of barrels of oil from Venezuela and oversee where the money flows. Venezuela has the largest proven reserves of crude in the world.",
        "url": "https://risingnepaldaily.com/news/74904",
        "scraped_at": "2026-01-30T20:28:46.108248"
    },
    {
        "title": "Traffic resumed on Kagbeni–Muktinath road",
        "content": "Mustang, Jan 30: The Kagbeni-Muktinath road, which had been blocked since Wednesday due to heavy snowfall, has been operational since this morning.\nThe road which was blocked has been reopened through the initiative of the District Administration Office and Baragung Muktikshetra Rural Municipality.\nThe 12-kilometre asphalt road to Muktinath was completely blocked on Tuesday night due to heavy snowfall.\nAn excavator of the Muktinath (Jomsom-Korala) Road Project was mobilized since Thursday afternoon to remove the snow from the road at the request of the District Administration Office and Baragung Muktikshetra Rural Municipality.",
        "url": "https://risingnepaldaily.com/news/74903",
        "scraped_at": "2026-01-30T20:28:47.214381"
    },
    {
        "title": "Over 400 thousand people in Sarlahi district to receive medication against elephantiasis",
        "content": "Barahathawa (Sarlahi), Jan 30: Over 400 thousand people across 12 local levels in Sarlahi district will be given medicines to prevent elephantiasis following a rise in infection in the area.\nThe District Health Office, Sarlahi aims to provide anti-elephantiasis drugs to a total of 430,941 people, covering about 80 per cent of the total population in the 12 affected local levels.\nThe District Health Office, Sarlahi has launched a special campaign after the lymphatic filariasis infection was found to be spreading rapidly in several local levels.\nThe Epidemiology and Disease Control Division at Teku, Kathmandu, in coordination with the World Health Organization had conducted the test in last October by dividing 20 local rural municipalities of the district into two groups.",
        "url": "https://risingnepaldaily.com/news/74906",
        "scraped_at": "2026-01-30T20:28:48.276294"
    },
    {
        "title": "NC for transformation: Spokesperson Chalise",
        "content": "Spokesperson of the Nepali Congress (NC), Devraj Chalise (File Photo)\nKathmandu, Jan 30: Spokesperson of the Nepali Congress (NC), Devraj Chalise, said the NC was embracing the aspiration of Gen Z youths.\nAt an inaugural session of the 'NC Dialogue' held here Friday, Spokesperson Chalise asserted that NC was going for elections by taking into account the party's glorious history and promising a convincing future. \"In addition to the changes sought by the Gen Zs, NC has also reformed its organization, style and action,\" Chalise shared.\nHe reminded the NC is not only focused on its own transformation but also committed to enforcing the policies aimed at ensuring change in the country.\nThe first edition of the NC Dialogue featured an interview given to Basanta Basnet, Editor-In-Chief of Onlinekhabar.",
        "url": "https://risingnepaldaily.com/news/74916",
        "scraped_at": "2026-01-30T20:28:49.227323"
    },
    {
        "title": "Hygienist Association demands to check toothpaste quality",
        "content": "Image for representation\nKathmandu, Jan 30: The Dental Sciences Hygienist Association of Nepal has demanded the bodies concerned to inspect and check the quality of toothpaste brands that are available in the market and bring them under the ambit of action as well as implement the necessary standard.\nIssuing a press release today, the Association mentioned that using the medicated toothpastes for long-term, which could not be used for more than four weeks, would seriously affect people's health.\nAssociation Chairperson Michael Devkota shared that though the Association since 2079 BS requested the Health Ministry and Department of Drug Administration time and again to check the quality of toothpastes available in markets and investigate its composition as much as possible, no standards have been made so far.\n\"Serious problems have surfaced in people's health due to the State's ignorant towards quality of toothpastes being used every day as well as selling of medicinal toothpastes, which should be sold at recommendation of dental human resources registered in different councils, at supermarkets,\" he added.",
        "url": "https://risingnepaldaily.com/news/74912",
        "scraped_at": "2026-01-30T20:28:50.397760"
    }
]